apache/nuttx/arch/arm/src/stm32/hardware/stm32g4xxxx_uart.h
#if (STM32_NUSART > 4)
#  define STM32_UART5_CR1              (STM32_UART5_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART5_CR2              (STM32_UART5_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART5_CR3              (STM32_UART5_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART5_BRR              (STM32_UART5_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART5_GTPR             (STM32_UART5_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART5_RTOR             (STM32_UART5_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART5_RQR              (STM32_UART5_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART5_ISR              (STM32_UART5_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART5_ICR              (STM32_UART5_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART5_RDR              (STM32_UART5_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART5_TDR              (STM32_UART5_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_UART5_PRESC            (STM32_UART5_BASE + STM32_USART_PRESC_OFFSET)
#endif

/* Register Bitfield Definitions ********************************************/

/* Control Register 1 */

#define USART_CR1_UE                   (1 << 0)                           /* Bit 0 - USART Enable */
#define USART_CR1_UESM                 (1 << 1)                           /* Bit 1 - USART Enable in low power Mode */
#define USART_CR1_RE                   (1 << 2)                           /* Bit 2 - Receiver Enable */
#define USART_CR1_TE                   (1 << 3)                           /* Bit 3 - Transmitter Enable */
#define USART_CR1_IDLEIE               (1 << 4)                           /* Bit 4 - IDLE Interrupt Enable */
#define USART_CR1_RXFNEIE              (1 << 5)                           /* Bit 5 in FIFO mode - Rx FIFO Not Empty Interrupt Enable */
#define USART_CR1_RXNEIE               (1 << 5)                           /* Bit 5 in Non-FIFO mode - Rx Data Register Not Empty Interrupt Enable */
#define USART_CR1_TCIE                 (1 << 6)                           /* Bit 6 - Transmission Complete Interrupt Enable */
#define USART_CR1_TXFNFIE              (1 << 7)                           /* Bit 7 in FIFO mode - Tx FIFO Not Full Interrupt Enable */
#define USART_CR1_TXEIE                (1 << 7)                           /* Bit 7 in Non-FIFO mode - Tx Data Register Empty Interrupt Enable */
#define USART_CR1_PEIE                 (1 << 8)                           /* Bit 8 - PE Interrupt Enable */
#define USART_CR1_PS                   (1 << 9)                           /* Bit 9 - Parity Selection */
#define USART_CR1_PCE                  (1 << 10)                          /* Bit 10 - Parity Control Enable */
#define USART_CR1_WAKE                 (1 << 11)                          /* Bit 11 - Receiver Wakeup method */
#define USART_CR1_M0                   (1 << 12)                          /* Bit 12 - Word length - Bit 0 */
#define USART_CR1_MME                  (1 << 13)                          /* Bit 13 - Mute Mode Enable */
#define USART_CR1_CMIE                 (1 << 14)                          /* Bit 14 - Character match interrupt enable */
#define USART_CR1_OVER8                (1 << 15)                          /* Bit 15 - Oversampling by 8-bit or 16-bit mode */
#define USART_CR1_DEDT_SHIFT           (16)                               /* Bits 20:16 - Driver Enable Deassertion Time, in 1/16ths or 1/8ths bit time */
#define USART_CR1_DEDT_MASK            (0x1f << USART_CR1_DEDT_SHIFT)
#  define USART_CR1_DEDT(n)            (((n) << USART_CR1_DEDT_SHIFT) & USART_CR1_DEDT_MASK)
#define USART_CR1_DEAT_SHIFT           (21)                               /* Bits 25:21 - Driver Enable Assertion Time, in 1/16ths or 1/8ths bit time */
#define USART_CR1_DEAT_MASK            (0x1f << USART_CR1_DEAT_SHIFT)
#  define USART_CR1_DEAT(n)            (((n) << USART_CR1_DEAT_SHIFT) & USART_CR1_DEAT_MASK)
#define USART_CR1_RTOIE                (1 << 26)                          /* Bit 26 - Receive Time Out interrupt enable */
#define USART_CR1_EOBIE                (1 << 27)                          /* Bit 27 - End of Block interrupt enable */
#define USART_CR1_M1                   (1 << 28)                          /* Bit 28 - Word length - Bit 1 */
#define USART_CR1_FIFOEN               (1 << 29)                          /* Bit 29 - FIFO mode enable */
#define USART_CR1_TXFEIE               (1 << 30)                          /* Bit 30 - TXFIFO empty interrupt enable */
#define USART_CR1_RXFFIE               (1 << 31)                          /* Bit 31 - RXFIFO Full interrupt enable */

#define USART_CR1_M_MASK               (USART_CR1_M0 | USART_CR1_M1)

#define USART_CR1_ALLINTS \
  (USART_CR1_IDLEIE | USART_CR1_RXNEIE | USART_CR1_TCIE | \
   USART_CR1_TXEIE | USART_CR1_PEIE | USART_CR1_CMIE | USART_CR1_RTOIE | \
   USART_CR1_EOBIE | USART_CR1_TXFEIE | USART_CR1_RXFFIE)

/* Control Register 2 */

#define USART_CR2_SLVEN                (1 << 0)                           /* Synchronous Slave Mode Enable */
#define USART_CR2_DIS_NSS              (1 << 3)                           /* Slave Select (NSS) Pin Ignore For SPI */
#define USART_CR2_ADDM7                (1 << 4)                           /* 7-Bit / 4-Bit Address Detection */
#define USART_CR2_LBDL                 (1 << 5)                           /* LIN Break Detection Length */
#define USART_CR2_LBDIE                (1 << 6)                           /* LIN Break Detection Interrupt Enable */
#define USART_CR2_LBCL                 (1 << 8)                           /* Last Bit Clock pulse */
#define USART_CR2_CPHA                 (1 << 9)                           /* Clock Phase */
#define USART_CR2_CPOL                 (1 << 10)                          /* Clock Polarity */
#define USART_CR2_CLKEN                (1 << 11)                          /* Clock Enable */
#define USART_CR2_STOP_SHIFT           (12)                               /* Stop Bit Mode */
#define USART_CR2_STOP_MASK            (0x3 << USART_CR2_STOP_SHIFT)
#  define USART_CR2_STOP1              (0x0 << USART_CR2_STOP_SHIFT)      /* 1 Stop Bit */
#  define USART_CR2_STOP0p5            (0x1 << USART_CR2_STOP_SHIFT)      /* 0.5 Stop Bit */
#  define USART_CR2_STOP2              (0x2 << USART_CR2_STOP_SHIFT)      /* 2 Stop Bits */
#  define USART_CR2_STOP1p5            (0x3 << USART_CR2_STOP_SHIFT)      /* 1.5 Stop Bits */
#define USART_CR2_LINEN                (1 << 14)                          /* LIN Mode Enable */
#define USART_CR2_SWAP                 (1 << 15)                          /* Swap TX/RX Pins */
#define USART_CR2_RXINV                (1 << 16)                          /* RX Pin Active Level Inversion */
#define USART_CR2_TXINV                (1 << 17)                          /* TX Pin Active Level Inversion */
#define USART_CR2_DATAINV              (1 << 18)                          /* Binary Data Inversion */
#define USART_CR2_MSBFIRST             (1 << 19)                          /* MSB First */
#define USART_CR2_ABREN                (1 << 20)                          /* Auto BAUD-Rate Enable */
#define USART_CR2_ABRMOD_SHIFT         (21)                               /* Auto BAUD-Rate Detection Mode */
#define USART_CR2_ABRMOD_MASK          (0x3 << USART_CR2_ABRMOD_SHIFT)
#  define USART_CR2_ABRMOD_STARTBIT    (0x0 << USART_CR2_ABRMOD_SHIFT)    /* Measurement of Start Bit */
#  define USART_CR2_ABRMOD_FALLEDGE    (0x1 << USART_CR2_ABRMOD_SHIFT)    /* Falling Edge To Falling Edge */
#  define USART_CR2_ABRMOD_7F_FRAME    (0x2 << USART_CR2_ABRMOD_SHIFT)    /* 0X7F Frame Detection */
#  define USART_CR2_ABRMOD_55_FRAME    (0x3 << USART_CR2_ABRMOD_SHIFT)    /* 0X55 Frame Detection */
#define USART_CR2_RTOEN                (1 << 23)                          /* Receiver Time-Out Enable */
#define USART_CR2_ADD8_SHIFT           (24)                               /* Address of the USART Node */
#define USART_CR2_ADD8_MASK            (0xff << USART_CR2_ADD8_SHIFT)

